tutorials/heatTransfer/directChillFoam/Lebon2020/0/Us
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           volVectorField;
    location        "0";
    object          Us;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

UCast           ( 0 0 -0.002583 );

UInitial        ( 0 0 0 );

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform $UCast;

boundaryField
{
    ram
    {
        type            fixedValue;
        value           uniform $UCast;
    }

    hot-top
    {
        type            noSlip;
    }

    "(graphite|mould|water-film)"
    {
        type            movingShell;
        value           $internalField;
    }

    free-surface
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
