tutorials/heatTransfer/directChillFoam/Lebon2020/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           volScalarField;
    location        "0";
    object          p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 1e5;

boundaryField
{
    "(hot-top|graphite|mould|water-film)"
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 1e5;
    }

    ram
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 1e5;
    }

    free-surface
    {
        type            fixedValue;
        value           uniform 1e5;
    }
}


// ************************************************************************* //
