tutorials/heatTransfer/directChillFoam/Lebon2020/Allrun.pre
#!/bin/bash

# Source tutorial run functions
source $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

# Mesh
runApplication blockMesh

# Initialization
runApplication setFields

# Decompose domain for parallelization
runApplication decomposePar

#------------------------------------------------------------------------------
