tutorials/heatTransfer/directChillFoam/Lebon2020/constant/tStar
(
    (-9999 757.375)
    (0.000 757.375)
    (0.001 789.250)
    (0.002 805.500)
    (0.003 812.375)
    (0.004 816.125)
    (0.005 818.625)
    (0.006 819.875)
    (0.007 821.125)
    (0.008 822.375)
    (0.009 823.000)
    (0.010 823.625)
    (0.012 824.250)
    (0.013 824.875)
    (0.015 825.500)
    (0.018 826.125)
    (0.019 828.625)
    (0.020 831.125)
    (0.021 833.000)
    (0.022 835.500)
    (0.023 837.375)
    (0.024 838.625)
    (0.025 840.500)
    (0.026 841.750)
    (0.027 843.000)
    (0.028 844.250)
    (0.029 844.875)
    (0.030 846.125)
    (0.031 847.375)
    (0.032 849.875)
    (0.033 851.750)
    (0.034 853.625)
    (0.035 854.875)
    (0.036 856.750)
    (0.037 858.000)
    (0.038 859.875)
    (0.039 861.125)
    (0.040 862.375)
    (0.041 863.625)
    (0.042 864.875)
    (0.043 865.500)
    (0.044 866.750)
    (0.045 868.000)
    (0.046 868.625)
    (0.047 869.875)
    (0.048 870.500)
    (0.049 871.125)
    (0.050 872.375)
    (0.051 873.000)
    (0.052 873.625)
    (0.053 874.250)
    (0.054 875.500)
    (0.055 876.125)
    (0.056 876.750)
    (0.057 877.375)
    (0.058 878.000)
    (0.059 878.625)
    (0.060 879.250)
    (0.061 879.875)
    (0.062 880.500)
    (0.063 881.125)
    (0.064 881.750)
    (0.065 882.375)
    (0.066 883.000)
    (0.068 883.625)
    (0.069 884.250)
    (0.070 884.875)
    (0.072 885.500)
    (0.073 886.125)
    (0.074 886.750)
    (0.076 887.375)
    (0.078 888.000)
    (0.079 888.625)
    (0.081 889.250)
    (0.083 889.875)
    (0.085 890.500)
    (0.086 891.125)
    (0.088 891.750)
    (0.090 892.375)
    (0.092 893.000)
    (0.094 893.625)
    (0.096 894.250)
    (0.098 894.875)
    (0.101 895.500)
    (0.103 896.125)
    (0.106 896.750)
    (0.108 897.375)
    (0.111 898.000)
    (0.114 898.625)
    (0.117 899.250)
    (0.121 899.875)
    (0.124 900.500)
    (0.128 901.125)
    (0.131 901.750)
    (0.135 902.375)
    (0.140 903.000)
    (0.144 903.625)
    (0.149 904.250)
    (0.154 904.875)
    (0.158 905.500)
    (0.162 906.125)
    (0.166 906.750)
    (0.171 907.375)
    (0.176 908.000)
    (0.181 908.625)
    (0.187 909.250)
    (0.192 909.875)
    (0.199 910.500)
    (0.205 911.125)
    (0.212 911.750)
    (0.220 912.375)
    (0.228 913.000)
    (0.236 913.625)
    (0.245 914.250)
    (0.255 914.875)
    (0.266 915.500)
    (0.277 916.125)
    (0.290 916.750)
    (0.304 917.375)
    (0.318 918.000)
    (0.335 918.625)
    (0.353 919.250)
    (0.372 919.875)
    (0.394 920.500)
    (0.419 921.125)
    (0.446 921.750)
    (0.477 922.375)
    (0.512 923.000)
    (0.551 923.625)
    (0.596 924.250)
    (0.647 924.875)
    (0.703 925.500)
    (0.763 926.125)
    (0.823 926.750)
    (0.879 927.375)
    (0.928 928.000)
    (1.000 929.250)
    (99999 929.250)
)