tutorials/heatTransfer/directChillFoam/Lebon2020/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "constant";
    object          transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

g_env           [ 0 0 0 0 0 0 0 ] 0.7;
rho1            [ 1 -3 0 0 0 0 0 ] 2608.820;
rho2            [ 1 -3 0 0 0 0 0 ] 2376.200;
mu1             [ 1 -1 -1 0 0 0 0 ] 11.5e-4;
mu2             [ 1 -1 -1 0 0 0 0 ] 10.5e-4;
DAS             [ 0 1 0 0 0 0 0 ] 1.85e-4;


// ************************************************************************* //
