tutorials/heatTransfer/directChillFoam/Lebon2020/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "system";
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    ( 16.0000000000000 -16.0000000000000 -300.0) //  0
    (-16.0000000000000 -16.0000000000000 -300.0) //  1
    (-16.0000000000000  16.0000000000000 -300.0) //  2
    ( 16.0000000000000  16.0000000000000 -300.0) //  3
    
    ( 54.8007755419574 -54.8007755419574 -300.0) //  4
    (-54.8007755419574 -54.8007755419574 -300.0) //  5
    (-54.8007755419574  54.8007755419574 -300.0) //  6
    ( 54.8007755419574  54.8007755419574 -300.0) //  7
    
    ( 16.0000000000000 -16.0000000000000 -57.0) //  8
    (-16.0000000000000 -16.0000000000000 -57.0) //  9
    (-16.0000000000000  16.0000000000000 -57.0) // 10
    ( 16.0000000000000  16.0000000000000 -57.0) // 11
    
    ( 54.8007755419574 -54.8007755419574 -57.0) // 12
    (-54.8007755419574 -54.8007755419574 -57.0) // 13
    (-54.8007755419574  54.8007755419574 -57.0) // 14
    ( 54.8007755419574  54.8007755419574 -57.0) // 15
    
    ( 16.0000000000000 -16.0000000000000 -40.0) // 16
    (-16.0000000000000 -16.0000000000000 -40.0) // 17
    (-16.0000000000000  16.0000000000000 -40.0) // 18
    ( 16.0000000000000  16.0000000000000 -40.0) // 19
    
    ( 54.8007755419574 -54.8007755419574 -40.0) // 20
    (-54.8007755419574 -54.8007755419574 -40.0) // 21
    (-54.8007755419574  54.8007755419574 -40.0) // 22
    ( 54.8007755419574  54.8007755419574 -40.0) // 23
    
    ( 16.0000000000000 -16.0000000000000   0.0) // 24
    (-16.0000000000000 -16.0000000000000   0.0) // 25
    (-16.0000000000000  16.0000000000000   0.0) // 26
    ( 16.0000000000000  16.0000000000000   0.0) // 27
    
    ( 54.8007755419574 -54.8007755419574   0.0) // 28
    (-54.8007755419574 -54.8007755419574   0.0) // 29
    (-54.8007755419574  54.8007755419574   0.0) // 30
    ( 54.8007755419574  54.8007755419574   0.0) // 31
    
    ( 16.0000000000000 -16.0000000000000 170.0) // 32
    (-16.0000000000000 -16.0000000000000 170.0) // 33
    (-16.0000000000000  16.0000000000000 170.0) // 34
    ( 16.0000000000000  16.0000000000000 170.0) // 35
    
    ( 54.8007755419574 -54.8007755419574 170.0) // 36
    (-54.8007755419574 -54.8007755419574 170.0) // 37
    (-54.8007755419574  54.8007755419574 170.0) // 38
    ( 54.8007755419574  54.8007755419574 170.0) // 39
);

blocks
(
    hex ( 1  0  3  2  9  8 11 10) domain (20 20 121) simpleGrading (1 1 1) //  0
    hex ( 0  4  7  3  8 12 15 11) domain (10 20 121) simpleGrading (1 1 1) //  1
    hex ( 3  7  6  2 11 15 14 10) domain (10 20 121) simpleGrading (1 1 1) //  2
    hex ( 2  6  5  1 10 14 13  9) domain (10 20 121) simpleGrading (1 1 1) //  3
    hex ( 1  5  4  0  9 13 12  8) domain (10 20 121) simpleGrading (1 1 1) //  4
    
    hex ( 9  8 11 10 17 16 19 18) domain (20 20  8) simpleGrading (1 1 1) //  5
    hex ( 8 12 15 11 16 20 23 19) domain (10 20  8) simpleGrading (1 1 1) //  6
    hex (11 15 14 10 19 23 22 18) domain (10 20  8) simpleGrading (1 1 1) //  7
    hex (10 14 13  9 18 22 21 17) domain (10 20  8) simpleGrading (1 1 1) //  8
    hex ( 9 13 12  8 17 21 20 16) domain (10 20  8) simpleGrading (1 1 1) //  9
    
    hex (17 16 19 18 25 24 27 26) domain (20 20 20) simpleGrading (1 1 1) // 10
    hex (16 20 23 19 24 28 31 27) domain (10 20 20) simpleGrading (1 1 1) // 11
    hex (19 23 22 18 27 31 30 26) domain (10 20 20) simpleGrading (1 1 1) // 12
    hex (18 22 21 17 26 30 29 25) domain (10 20 20) simpleGrading (1 1 1) // 13
    hex (17 21 20 16 25 29 28 24) domain (10 20 20) simpleGrading (1 1 1) // 14
    
    hex (25 24 27 26 33 32 35 34) domain (20 20 85) simpleGrading (1 1 1) // 15
    hex (24 28 31 27 32 36 39 35) domain (10 20 85) simpleGrading (1 1 1) // 16
    hex (27 31 30 26 35 39 38 34) domain (10 20 85) simpleGrading (1 1 1) // 17
    hex (26 30 29 25 34 38 37 33) domain (10 20 85) simpleGrading (1 1 1) // 18
    hex (25 29 28 24 33 37 36 32) domain (10 20 85) simpleGrading (1 1 1) // 19
);

edges
(
    arc  7  4 ( 77.500000000000000000   0.000000000000000000 -300.0)
    arc  4  5 (  0.00000000000000e+00 -77.500000000000000000 -300.0)
    arc  5  6 (-77.500000000000000000   0.00000000000000e+00 -300.0)
    arc  6  7 (  0.000000000000000000  77.500000000000000000 -300.0)
    
    arc 15 12 ( 77.500000000000000000   0.000000000000000000 -57.0)
    arc 12 13 (  0.00000000000000e+00 -77.500000000000000000 -57.0)
    arc 13 14 (-77.500000000000000000   0.00000000000000e+00 -57.0)
    arc 14 15 (  0.000000000000000000  77.500000000000000000 -57.0)
    
    arc 23 20 ( 77.500000000000000000   0.000000000000000000 -40.0)
    arc 20 21 (  0.00000000000000e+00 -77.500000000000000000 -40.0)
    arc 21 22 (-77.500000000000000000   0.00000000000000e+00 -40.0)
    arc 22 23 (  0.000000000000000000  77.500000000000000000 -40.0)
    
    arc 31 28 ( 77.500000000000000000   0.000000000000000000   0.0)
    arc 28 29 (  0.00000000000000e+00 -77.500000000000000000   0.0)
    arc 29 30 (-77.500000000000000000   0.00000000000000e+00   0.0)
    arc 30 31 (  0.000000000000000000  77.500000000000000000   0.0)
    
    arc 39 36 ( 77.500000000000000000   0.000000000000000000 170.0)
    arc 36 37 (  0.00000000000000e+00 -77.500000000000000000 170.0)
    arc 37 38 (-77.500000000000000000   0.00000000000000e+00 170.0)
    arc 38 39 (  0.000000000000000000  77.500000000000000000 170.0)
    
    arc  3  0 ( 20.000000000000000000   0.000000000000000000 -300.0)
    arc  0  1 (  0.00000000000000e+00 -20.000000000000000000 -300.0)
    arc  1  2 (-20.000000000000000000   0.00000000000000e+00 -300.0)
    arc  2  3 (  0.000000000000000000  20.000000000000000000 -300.0)
    
    arc 11  8 ( 20.000000000000000000   0.000000000000000000 -57.0)
    arc  8  9 (  0.00000000000000e+00 -20.000000000000000000 -57.0)
    arc  9 10 (-20.000000000000000000   0.00000000000000e+00 -57.0)
    arc 10 11 (  0.000000000000000000  20.000000000000000000 -57.0)
    
    arc 19 16 ( 20.000000000000000000   0.000000000000000000 -40.0)
    arc 16 17 (  0.00000000000000e+00 -20.000000000000000000 -40.0)
    arc 17 18 (-20.000000000000000000   0.00000000000000e+00 -40.0)
    arc 18 19 (  0.000000000000000000  20.000000000000000000 -40.0)
    
    arc 27 24 ( 20.000000000000000000   0.000000000000000000   0.0)
    arc 24 25 (  0.00000000000000e+00 -20.000000000000000000   0.0)
    arc 25 26 (-20.000000000000000000   0.00000000000000e+00   0.0)
    arc 26 27 (  0.000000000000000000  20.000000000000000000   0.0)
    
    arc 35 32 ( 20.000000000000000000   0.000000000000000000 170.0)
    arc 32 33 (  0.00000000000000e+00 -20.000000000000000000 170.0)
    arc 33 34 (-20.000000000000000000   0.00000000000000e+00 170.0)
    arc 34 35 (  0.000000000000000000  20.000000000000000000 170.0)
);

boundary
(
    water-film
    {
        type wall;
        faces
        (
            ( 4  7 15 12)
            ( 5  4 12 13)
            ( 6  5 13 14)
            ( 7  6 14 15)
        );
    }

    mould
    {
        type wall;
        faces
        (
            (12 15 23 20)
            (13 12 20 21)
            (14 13 21 22)
            (15 14 22 23)
        );
    }

    graphite
    {
        type wall;
        faces
        (
            (20 23 31 28)
            (21 20 28 29)
            (22 21 29 30)
            (23 22 30 31)
        );
    }

    hot-top
    {
        type wall;
        faces
        (
            (28 31 39 36)
            (29 28 36 37)
            (30 29 37 38)
            (31 30 38 39)
        );
    }

    ram
    {
        type patch;
        faces
        (
            ( 3  0  1  2)
            ( 3  7  4  0)
            ( 2  6  7  3)
            ( 1  5  6  2)
            ( 0  4  5  1)
        );
    }

    free-surface
    {
        type patch;
        faces
        (
            (35 32 33 34)
            (35 39 36 32)
            (34 38 39 35)
            (33 37 38 34)
            (32 36 37 33)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
