tutorials/heatTransfer/directChillFoam/Lebon2020/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format          ascii;
    class           dictionary;
    location        "system";
    object          fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "rho.*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       0;
        relTol          0;
    }

    pcorr
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0.0001;
    }

    pcorrFinal
    {
        $pcorr          ;
    }

    p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-08;
        relTol          0.0001;
    }

    "(T|p_rghFinal)"
    {
        $p_rgh          ;
        relTol          0;
    }

    "(U|k|omega|epsilon|R)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0.0001;
    }

    "(U|k|omega|epsilon|R)Final"
    {
        $U              ;
        relTol          0;
    }

    "(h|e|C.*)"
    {
        $U              ;
        tolerance       1e-08;
        relTol          0.0001;
    }
    
    "(h|e|C.*)Final"
    {
        $h              ;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor no;
    nOuterCorrectors 1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    nEnergyCorrectors 3;
}

relaxationFactors
{
    fields
    {
        p               1;
        T               1;
    }
    equations
    {
        "(h|E)"         1;
        "(U|k|omega|epsilon)" 1;
        "C..*"          0.5;
        ".*"            1;
    }
}


// ************************************************************************* //
